export default [
  {
    id: '1',
    title: '一心一意',
    explain: '同心同意。亦用于指心意专一，毫无他念。',
    fromwhere:
      '儒林外史．第五十二回：「陈正公见他如此至诚，一心一意要把银子借与他。'
  },
  {
    id: '2',
    title: '一目了然',
    explain: '看一眼就完全清楚明白',
    fromwhere:
      '《朱子语类》：「见得道理透后，从高视下，一目了然。今要去揣摩，不得。」'
  },
  {
    id: '3',
    title: '一刀两断',
    explain: '比喻断绝关系。形容行事干脆爽快。',
    fromwhere:
      '朱子语类．卷四十四．论语．宪问篇：「观此，可见『克己』者是从根源上一刀两断，便斩绝了，更不复萌。」'
  },
  {
    id: '4',
    title: '画蛇添足',
    explain: '比喻多此一举，反将事情弄糟。',
    fromwhere:
      '三国演义．第一一○回：「将军功绩已成，威声大震，可以止矣。今若前进，倘不如意，正如画蛇添足也。」'
  },
  {
    id: '5',
    title: '美中不足',
    explain: '事物虽美，但仍有缺陷。',
    fromwhere:
      '明．无名氏．运甓记．第二十三出：「只这一州未归掌握，杖击折翼，这是美中不足。」'
  },
  {
    id: '6',
    title: '本末倒置',
    explain: '比喻不知事情的轻重缓急。',
    fromwhere:
      '清．王昶《金石萃编．卷一五八．金五．绥德州新学记》：然非知治之审，则亦未尝不本末倒置。'
  },
  {
    id: '7',
    title: '九死一生',
    explain: '比喻幸免于死的人很少，亦用于比喻生命迹象微弱，濒临死亡。',
    fromwhere:
      '《六臣注文选．屈原．离骚》：言忠信贞洁，我心所善，以此遇害，虽九死无一生，未足悔恨。'
  },
  {
    id: '8',
    title: '以貌取人',
    explain: '以容貌的美丑作为认识、评断或任用人才的标准。',
    fromwhere:
      '《韩非子．显学》：孔子曰：「以容取人乎？失之子羽；以言取人乎？失之宰予。」，后演变成「以貌取人」'
  },
  {
    id: '9',
    title: '画饼充饥',
    explain: '比喻徒事空想无益于事。',
    fromwhere: '《三国志》：选举莫取有名，名如画地作饼，不可啖也。'
  },
  {
    id: '10',
    title: '一触即发',
    explain: '比喻很紧张的情势或很危险的时刻',
    fromwhere:
      '明．李开先《原性堂记》：予方有意，触而即发，不知客何所见，适投其机乎？'
  },
  {
    id: '11',
    title: '打草惊蛇',
    explain: '比喻对付敌人时，行事不密，致使对方有所警觉，而预先防备。',
    fromwhere:
      '宋．郑文宝《南唐近事．卷二》：鲁乃判曰：「汝虽打草，吾已蛇惊。」'
  },
  {
    id: '12',
    title: '一日千里',
    explain: '形容良马跑得很快。比喻进步神速或事业发展得很快。',
    fromwhere:
      '后汉书．卷六十六．王允传：「同郡郭林宗尝见允而奇之曰：『王生一日千里，王佐才也。』」'
  },
  {
    id: '13',
    title: '出口成章',
    explain: '从口中说出的话有章法有文理。比喻才思敏捷，谈吐风雅。',
    fromwhere:
      '《诗经．小雅．都人士》：彼都人士，狐裘黄黄。其容不改，出言有章。行归于周，万民所望。'
  },
  {
    id: '14',
    title: '狡兔三窟',
    explain: '比喻有多处藏身的地方或多种避祸的准备。',
    fromwhere: '《战国策．齐策四》：狡兔有三窟，仅得免其死耳。'
  },
  {
    id: '15',
    title: '如鱼得水',
    explain: '比喻得到志同道合的人或适合于自己发展的环境。',
    fromwhere: '秦．李斯《用笔法》：如游鱼得水，景山兴云，或卷或舒，乍轻乍重'
  },
  {
    id: '16',
    title: '九死一生',
    explain: '比喻幸免于死的人很少，亦用于比喻生命迹象微弱，濒临死亡。',
    fromwhere:
      '《六臣注文选．屈原．离骚》：言忠信贞洁，我心所善，以此遇害，虽九死无一生，未足悔恨。'
  },
  {
    id: '17',
    title: '一丘之貉',
    explain: '比喻彼此同样低劣，并无差异。',
    fromwhere:
      '聊斋志异．卷七．细柳：「黑心符出，芦花变生，古与今如一丘之貉，良可哀也！」'
  },
  {
    id: '18',
    title: '迫在眉睫',
    explain: '形容事情急迫。',
    fromwhere: '《列子．仲尼》：「远在八荒之外，近在眉睫之内。」'
  },
  {
    id: '19',
    title: '缺一不可',
    explain: '少一样也不行。',
    fromwhere:
      '明．施耐庵《水浒传》第二十回：「林冲道：只今番克敌制胜，便见得先生妙法。正是鼎分三足，缺一不可，先生不必推却。」'
  },
  {
    id: '20',
    title: '忠言逆耳',
    explain: '诚恳正直的规劝往往刺耳，而不易被人接受。',
    fromwhere:
      '孔子家语．卷四．六本：「良药苦於口而利於病，忠言逆於耳而利於行。」'
  },
  {
    id: '21',
    title: '八拜之交',
    explain: '指结拜为异姓兄弟姊妹的朋友。',
    fromwhere:
      '元．王实甫《西厢记．第一本．第一折》：路经河中府，过蒲关上，有一故人，姓杜名确，字君实，与小生同郡同学，当初为八拜之交。'
  },
  {
    id: '22',
    title: '鸡犬升天',
    explain: '比喻一个人发达得势，左右有关系的人也跟着发迹。',
    fromwhere:
      '汉．王充《论衡．道虚》：「淮南王刘安坐反而死，天下并闻，当时并见，儒书尚有言其得道仙去，鸡犬升天者。」'
  },
  {
    id: '23',
    title: '阳奉阴违',
    explain: '表面上装着遵守奉行，实际上却违反不照办。',
    fromwhere:
      '官场现形记．第三十三回：「劝戒属员，嗣后不准再到秦淮河吃酒住夜；倘若阳奉阴违，定行参办不贷。」'
  },
  {
    id: '24',
    title: '人面兽心',
    explain: '形容人凶狠残暴，心肠狠毒残忍，如野兽一般',
    fromwhere:
      '《汉书．卷九四．匈奴传下》：……夷狄之人贪而好利，被发左衽，人面兽心，其与中国殊章服．．．．'
  },
  {
    id: '25',
    title: '兔死狗烹',
    explain: '比喻事成之后，有功之人即遭到杀戮或见弃的命运。',
    fromwhere: '《淮南子．说林》：狡兔得而猎犬烹，高鸟尽而强弩藏。'
  },
  {
    id: '26',
    title: '一目十行',
    explain: '比喻阅读迅速',
    fromwhere:
      '红楼梦．第二十三回：「你说你会过目成诵，难道我就不能一目十行了？」亦作「目下十行」。'
  },
  {
    id: '27',
    title: '一帆风顺',
    explain: '比喻非常顺利，毫无阻碍。',
    fromwhere: '杨万里《晓出洪泽霜晴风顺》诗：明早都梁各分手，顺风便借一帆回。'
  },
  {
    id: '28',
    title: '出尔反尔',
    explain: '比喻人的言行前后反覆，自相矛盾。',
    fromwhere:
      '官场现形记．第五十九回：「倘若不肯，也只好由他，我不能做出尔反尔的事。」'
  },
  {
    id: '29',
    title: '东窗事发',
    explain: '后指阴谋或非法勾当败露。',
    fromwhere:
      '刘一清《钱塘遗事．卷二．东窗事发》：桧曰：「可烦传语夫人，东窗事发矣。」'
  },
  {
    id: '30',
    title: '黯然失色',
    explain: '黯淡而失去光彩。',
    fromwhere:
      '梁．江淹《别赋》：「黯然销魂者，惟别而已矣。」李善注：「黯然，失色貌」'
  }
]
